;;版本:V1.3.6_LCDP /1080x1920 /F2.16 ';'后面接的是注释
M8513		;清除之前配置参数，参数恢复出厂设置，重新配置参数
M8004 I-1;Z电机方向
M8005 Z0 ;Z轴 0:挤出头动 1:平台动
M8006 I5;起始速度
M8007 I2;轨弯速度
M8008 I900;加速度
M8010 S0.000625;z每步mm
M8013 I5;Z最大速度
M8015 I3;Z第一次归零速度
M8016 I3;Z第二次归零速度
M8015 P2.000000;Z慢速上升的速度
M8016 P3.000000;Z快速上升和下降的速度
M8016 D10;Z上升后等待的毫秒数
M8020 S3.000000;Makerware退丝长度
M8021 S1.750000;耗材直径
M8028 S0.000000;退丝补偿
M8030 T128;主板散热风扇MB_F控制，1：跟随曝光 0 ：常闭 -1:常开 -2:跟随打印
M8030 S4;LED控制，0 ：常闭 1：常开 2：跟随模型打印 4：跟随曝光
M8070 S3.000000;每次Z慢速上升移动距离
M8071 X1080 Y1920;投影分辨率
M8070 T0;投影仪预热时间
M8070 Z6.000000;每次Z上升移动的距离
M8070 I9600;投影仪波特率
M8026 I130.000000;Z最大行程
M8029 I0;XY限位 0:最小限位 1：最大限位 2:双边限位
M8029 T1;限位接线 0:限位常开 1:限位常闭
M8029 S0;Z限位类型 0:最小限位 1:最大限位
M8029 C0 ;XYZ归位后动作 0:回零点(0,0,0) 1:停在限位位置
M8034 I0;文件夹支持与否
M8083 I1;是否使能自动调平
M8030 C0;Z归位后动作 0:回零点(0,0,0) 1:停在限位位置
M8030 I-2;LED风扇LED_F控制,1：跟随曝光 0 ：常闭 -1:常开 -2:跟随打印
M8084 Z0.000000;三角洲Z偏移，0:禁止偏移，行程由设Z为零确定，非0，行程由调平触发器触发位置+偏移值
M8085 I5000;开机logo持续时间，最小100ms,最大6000ms
M8085 T0;屏保待机等待时间,单位是秒
M8087 I0 T0;I:方向有效到脉冲有效的时间(ns),T:脉冲最短保持时间(ns).如果没有外接驱动，请全部设为0
M9003 "CBD"  
M8500		;保存配置
